import React, { Component } from "react";
import { render } from "react-dom";
import {
  Text,
  StyleSheet,
  View,
  TextInput,
  TouchableOpacity,
  Alert,
  ActivityIndicator,
} from "react-native";

import { NavigationContainer } from "react-navigation";

import Svg, { Defs, ClipPath, Path, G } from "react-native-svg";




class privacyPolicy extends Component {
 render() {


/* SVGR has dropped some elements not supported by react-native-svg: filter */


  return (
    <View>
      <Svg viewBox="0 0 375 812"  >
        <Defs>
          <ClipPath id="prefix__a">
            <Path d="M0 0h375v812H0z" />
          </ClipPath>
        </Defs>
        <G data-name="Policy Screen" clipPath="url(#prefix__a)">
          <Path fill="#fff" d="M0 0h375v812H0z" />
          <G data-name="Group 6">
            <G filter="url(#prefix__b)">
              <Path
              style={{top:-100}}
                data-name="Path 117"
                d="M27-32h322a38 38 0 0138 38v50a38 38 0 01-38 38H27a38 38 0 01-38-38V6a38 38 0 0138-38z"
                fill="#ffeed6"
              />
            </G>
            <Path
               
              data-name="Icon ionic-ios-arrow-back"
              d="M35.05 51.069l11.1-12.154a2.446 2.446 0 000-3.244 1.976 1.976 0 00-2.968 0L30.611 49.442a2.455 2.455 0 00-.061 3.164l12.621 13.87a1.978 1.978 0 002.968 0 2.446 2.446 0 000-3.244z"
              fill="#4f3c75"
              onPress={() => this.props.navigation.navigate("صفحة التسجيل")}
            />

            <Svg style={styles.SvgComp}>
            <G fill="#4f3c75" >
              <Path
                data-name="Path 1"
                d="M269.074 57.108l-.144.287a62.4 62.4 0 00-2.536 5.885 4.491 4.491 0 00-.335 1.627q0 2.059 2.488 3.11a16.082 16.082 0 002.967.287 13.135 13.135 0 004.737-.861 18.066 18.066 0 005.742-3.445v-.431a14.832 14.832 0 00-.335-3.254q-.384-1.675-.861-3.254l2.584-5.981a14.761 14.761 0 011.531 6.507 16.339 16.339 0 01-.239 2.775 21.882 21.882 0 01-3.541 8.756 13.838 13.838 0 01-6.651 5.263 11.033 11.033 0 01-3.828.766 6.459 6.459 0 01-3.014-.718q-2.871-1.387-3.254-5.933v-.763q0-4.5 4.163-12.153.574-1.051 1.268-2.249t1.316-2.3l.718.383.1.048 3.732 2.536q-.766 1.435-1.531 2.8t-1.531 2.7z"
              />
              <Path
                data-name="Path 2"
                d="M294.815 45.81q-2.3.431-4.593.837t-4.593.837l2.871-5.694q4.976-.908 9.187-1.723z"
              />
              <Path
                data-name="Path 3"
                d="M296.011 52.462a14.4 14.4 0 01-1.268 5.215 8.835 8.835 0 01-3.517 4.455q-2.871 1.627-9.617 2.057l.67-6.412h.048q7.416-.384 9.857-1.244t3.684-4.163z"
              />
              <Path
                data-name="Path 4"
                d="M325.592 46.948l-6.886-10.329-.008-.011-.037-.05a.86.86 0 00-1.378.05l-.008.011-6.886 10.329a.863.863 0 00.108 1.086 10.892 10.892 0 013.11 6.364 4.408 4.408 0 00-1.641 3.427.859.859 0 00.861.85h10.329a.859.859 0 00.861-.85 4.364 4.364 0 00-1.254-3.074 4.581 4.581 0 00-.385-.349 10.9 10.9 0 013.11-6.364.861.861 0 00.104-1.09zm-7.775-.367a.861.861 0 11-.677.676.861.861 0 01.677-.676zm-3.989 10.37a2.631 2.631 0 012.435-1.779h3.444a2.63 2.63 0 012.435 1.779zm6.926-3.368a4.186 4.186 0 00-1.047-.132h-3.439a4.185 4.185 0 00-1.047.132 12.63 12.63 0 00-3.022-6.25l4.933-7.392v5.051a2.583 2.583 0 101.721 0v-5.051l4.929 7.392a12.629 12.629 0 00-3.025 6.25z"
              />
              <Path
                data-name="Path 5"
                d="M315.727 61.632a10.443 10.443 0 011.475-.655 14.326 14.326 0 001.5-2.744c.1-.227.185-.45.274-.666-.189.019-.379.035-.569.044v.344a.6.6 0 11-1.2 0v-.367c-1.385-.112-2.751-.378-4.145-.392a.6.6 0 01-.19-.03 43.515 43.515 0 01-5.56.586q-.767.048-1.483.048a29.315 29.315 0 01-4.834-.383 6.588 6.588 0 01-4.257-1.962 4.178 4.178 0 01-.877-1.876 15.831 15.831 0 01-3.041 3.018.6.6 0 01-.518.13 7.176 7.176 0 00.463 2.176 6.176 6.176 0 003.853 3.732 19.491 19.491 0 006.434 1.2 10 10 0 001.006.048 37.646 37.646 0 006.028-.574 26.548 26.548 0 005.37-1.37.542.542 0 01.271-.307z"
              />
              <Path
                data-name="Path 6"
                d="M320.886 59.896c1-.306 3.286-.916 3.15-2.307a.6.6 0 010-.148c-.053-.2-.106-.407-.167-.609a.725.725 0 01-.292 0c-.2-.036-.4-.057-.6-.077a.019.019 0 010 .008.605.605 0 01-.6.6 1.183 1.183 0 00-.16.01l-.093.021c-.059.014-.12.03-.175.048l-.078.028.017-.008a.606.606 0 01-.762-.19c-.91.12-1.811.286-2.724.335v.344a.6.6 0 01-1.2 0v-.362c-.154-.013-.31-.026-.464-.042l-.665 3.9a32.481 32.481 0 014.813-1.551z"
              />
              <Path
                data-name="Path 7"
                d="M334.184 60.778l.048-.048q.718-.287 1.914-.742t2.536-.933q1.339-.479 2.775-1t2.727-.957l-1.388 2.2q-2.584.91-5.287 1.89a50.059 50.059 0 00-4.856 2.026v.048z"
              />
              <Path
                data-name="Path 8"
                d="M335.525 34.224l3.541-5.6 1.388 20.335-3.541 5.6z"
              />
              {/* <Path
                data-name="Path 9"
                d="M316.044 26.785v-.1a8.188 8.188 0 00-2.966-.622 22.56 22.56 0 00-1.34-.048 3.845 3.845 0 00-2.105.431q-.239.191-.646.574a2.183 2.183 0 01-.55.431h-.048a7.616 7.616 0 01.622-1.818 12.344 12.344 0 011.77-2.919q.623-.718 2.919-.718h.861q3.061.144 3.78.909a1.783 1.783 0 01.478 1.2 4.708 4.708 0 01-.67 2.153 7.515 7.515 0 01-3.684 3.541 10.142 10.142 0 01-2.225.742 19.7 19.7 0 01-2.273.311l-.479-.048q.144-.384 2.966-1.746a11.969 11.969 0 003.59-2.273z"
              /> */}
              <Path
                data-name="Path 10"
                d="M288.362 32.003q.764-.287 1.938-.718t2.512-.933q1.339-.5 2.775-1.029t2.679-.957l-1.388 2.2q-2.584.908-5.239 1.89t-4.856 2.033z"
              />
              <Path
                data-name="Path 11"
                d="M317.784 35.079q-.642-1.016-1.278-1.988t-1.244-1.978l2.929-1.914q.653.978 1.267 1.964t1.261 2z"
              />
            </G>
            </Svg>
          </G>
        </G>
      </Svg>
      <Text style={styles.textStyle}>
        نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم
         إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها
         منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه
         البيانات الشخصية. التصفح لم نقم بتصميم هذا الموقع أو التطبيق من أجل
         تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا
         الموقع, وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض
         إرادتك. عنوان بروتوكول شبكة الإنترنت (IP) في أي وقت تزور فيه اي موقع
         انترنت بما فيها هذا الموقع أو التطبيق , سيقوم السيرفر المضيف بتسجيل
         عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك , تاريخ ووقت الزيارة ونوع
         متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع
         الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة.{" "}
       </Text>
      <TouchableOpacity
        style={styles.button}
        onPress={() => this.props.navigation.navigate("صفحة التسجيل")}
      >
        <Text
          style={{
            color: "#FFEED6",
            fontSize: 25,
          }}
        >
          عودة
        </Text>
      </TouchableOpacity>
    </View>
  );
 } }
 
const styles = StyleSheet.create({
  container: {
    flex: 1,
    display: "flex",
    flexDirection: "column",
    justifyContent: "center",
    padding: 35,
    backgroundColor: "#fff",
  },
  textStyle: {
    top: 150,
    alignSelf: "center",
    textAlign: "center",
    backgroundColor: "#fff",
    fontSize: 22,
    color: "#4F3C75",
    position:"absolute",
    marginLeft:90,
  },
  button: {
    alignItems: "center",
    backgroundColor: "#4F3C75",
    padding: 10,
    borderRadius: 25,
    width: 279,
    height: 50,
    alignSelf: "center",
    bottom: 50,
    position:"absolute",
  },
  SvgComp: {
    marginTop:20,
  },
});

export default privacyPolicy;