import React from "react";

const privacyPolicy = () => {
  return (
    <div>
      <p>
        نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم
        إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها
        منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه
        البيانات الشخصية. التصفح لم نقم بتصميم هذا الموقع أو التطبيق من أجل
        تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا
        الموقع, وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض
        إرادتك. عنوان بروتوكول شبكة الإنترنت (IP) في أي وقت تزور فيه اي موقع
        انترنت بما فيها هذا الموقع أو التطبيق , سيقوم السيرفر المضيف بتسجيل
        عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك , تاريخ ووقت الزيارة ونوع
        متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع
        الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة.{" "}
      </p>
    </div>
  );
};

export default privacyPolicy;
