import React from "react";

const privacyPolicy = () => {
  return (
    <div>
      <p>
        نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم
        إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها
        منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه
        البيانات الشخصية. التصفح لم نقم بتصميم هذا الموقع أو التطبيق من أجل
        تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا
        الموقع, وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض
        إرادتك. سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية
        التي نتحصل عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً
        بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً
        أو مرغوباً فيه للتمشي مع القانون , أو للدفاع عن أو حماية حقوق الملكية
        الخاصة بهذا الموقع أو الجهات المستفيدة منه.
      </p>
    </div>
  );
};

export default privacyPolicy;
